Sver0411/AdaptiveSense/firmware/sdkconfig.defaults
# AdaptiveSense ESP32-S3 default sdkconfig (kept minimal and public).
CONFIG_IDF_TARGET="esp32s3"

# --- Core options ---
CONFIG_ESPTOOLPY_FLASHMODE_DIO=y
# Reference board is an ESP32-S3 N16R8: 16 MB flash, 8 MB octal PSRAM.
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y

# --- PSRAM (N16R8 has 8 MB octal) ---
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y

# --- FreeRTOS ---
CONFIG_FREERTOS_HZ=1000
# Automatic light sleep (tickless idle) is deliberately left off: the duty cycle
# is driven explicitly by power_sleep() in the main loop, so the node's timing
# is observable and reproducible instead of being applied by the idle task.
CONFIG_FREERTOS_USE_TICKLESS_IDLE=n

# --- Power management ---
# The dynamic frequency scaling / automatic light sleep governor is not used;
# esp_light_sleep_start() is called explicitly for each scheduled sleep.
CONFIG_PM_ENABLE=n

# --- Application memory ---
# The change detector and scheduler live in static storage (see main.c), so the
# main task stack stays close to the default.
CONFIG_ESP_MAIN_TASK_STACK_SIZE=6144

# --- Logging ---
CONFIG_LOG_DEFAULT_LEVEL_INFO=y

# --- Components required by the application ---
CONFIG_MQTT_PROTOCOL_311=y
# Wi-Fi modem sleep (WIFI_PS_MIN_MODEM) needs the power-save build options.
CONFIG_ESP_WIFI_ENABLE_WPA3_SAE=n
